Revit 2026 API

# DuctLiningTypeRoughness Property

---

The roughness of Duct Lining.

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double Roughness { get; set; }
```
```vb
Public Property Roughness As Double
	Get
	Set
```
```cpp
public:
property double Roughness {
	double get ();
	void set (double value);
}
```
```fsharp
member Roughness : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The roughness value should be at least equal to or larger than 0. |

#### Reference

DuctLiningType Class

Autodesk.Revit.DB.Mechanical Namespace